<?php

//Поиск (бинарный поиск)

//Нужно поработать с норм массивами

// (l r]
$arr = [];

$n = 1001;

for ($i = 0; $i < $n; $i++) {
    $arr[$i] = $i;
}


$r = count($arr); //правая граница arr
$l = 0; //левая граница arr
//добавляем 0 элемент

$x = 22;
echo 'X = ' . $x . '<br />';
echo '-----------------<br />';
//длина промежутка r - l
while (($r - $l) > 1) {
    $m = (int)(($l + $r) / 2); // середина
    if ($arr[$m] >= $x) { // если середина больше или равна X, берем левую часть
        echo '(' . $l . ' ...here... ' . $m . ' ....... ' . $r . ']<br />';
        $r = $m; //середину берем как последний элемент
        echo '-----------------<br />';
    } else {
        echo '(' . $l . ' ....... ' . $m . ' ...here... ' . $r . ']<br />';
        $l = $m; //середину берем как первый элемент
        echo '-----------------<br />';
    }
}

echo 'Find is = ' . $r;